<a href="https://colab.research.google.com/github/capitallatera/Assignments/blob/master/Assignment_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd

In [0]:
# Write a Python program to create and display a one- dimensional array-like object containing an array of data using Pandas module.
arr=pd.Series([1,2,3,4,5])
print(type(arr))
arr

<class 'pandas.core.series.Series'>

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [0]:
# Write a Python program to convert a Panda module Series to Python list and its type. 
arr=pd.Series([1,2,3,4,5])
print(type(arr),"\n")
print(type(list(arr)),"\n",list(arr))

<class 'pandas.core.series.Series'>

<class 'list'>
 [1, 2, 3, 4, 5]

In [0]:
# Write a Python program to add, subtract, multiple and divide two Pandas Series.
arr_1=pd.Series([6,7,8,9,1])
arr_2=pd.Series([1,2,3,4,5])

add=arr_1.add(arr_2)
sub=arr_1.subtract(arr_2)
mul=arr_1.mul(arr_2)
div=arr_1.div(arr_2)

table={'arr_1':arr_1,'arr_2':arr_2,'Add':add,'Subtract':sub,'Multiplication':mul,'Division':div} 
df=pd.DataFrame(table)
df

   arr_1  arr_2  Add  Subtract  Multiplication  Division
0      6      1    7         5               6  6.000000
1      7      2    9         5              14  3.500000
2      8      3   11         5              24  2.666667
3      9      4   13         5              36  2.250000
4      1      5    6        -4               5  0.200000

In [0]:
# Write a Python program to compare the elements of the two Pandas Series.
arr_1=pd.Series(np.random.randint(1,6,5))
arr_2=pd.Series(np.random.randint(1,9,5))
equals=arr_1==arr_2
greaterthen=arr_1>arr_2
lessthen=arr_1<arr_2
data=pd.DataFrame({"arr_1":arr_1,"arr_2":arr_2,"==":equals,">":greaterthen,"<":lessthen})
data

   arr_1  arr_2     ==      >      <
0      4      2  False   True  False
1      2      6  False  False   True
2      2      2   True  False  False
3      5      3  False   True  False
4      2      5  False  False   True

In [0]:
# Write a Python program to display the following data column wise.
## data is self generated
## dataset required
data={"A":[1,2,3,4,5],"B":[6,7,8,9,0]}
df=pd.DataFrame(data)
df

   A  B
0  1  6
1  2  7
2  3  8
3  4  9
4  5  0

In [0]:
#  Write a Python program to create and display a Data Frame from a specified dictionary data which has the index labels. 
data={"A":[1,2,3,4,5],"B":[6,7,8,9,0]}
df=pd.DataFrame(data)
print(df)
df=pd.DataFrame(data,index=list('abcde'))
df

   A  B
0  1  6
1  2  7
2  3  8
3  4  9
4  5  0

   A  B
a  1  6
b  2  7
c  3  8
d  4  9
e  5  0

In [0]:
# # Write a Python program to select the specified columns and rows from a given Data Frame. 

data={"A":[1,2,3,4,5],"B":[6,7,8,9,0],"P":["a",'b','c','d','e'],"Q":['f','g','h','i','j']}
df=pd.DataFrame(data)
print(df)
print("Selecting specified column \n")
print(df[["A","P"]])
print("\nSelecting specified rows \n ")
print(df.iloc[[0,2,4]])

   A  B  P  Q
0  1  6  a  f
1  2  7  b  g
2  3  8  c  h
3  4  9  d  i
4  5  0  e  j
Selecting specified column

   A  P
0  1  a
1  2  b
2  3  c
3  4  d
4  5  e

Selecting specified rows

   A  B  P  Q
0  1  6  a  f
2  3  8  c  h
4  5  0  e  j

In [0]:
# Write a Python program to select the rows the score is between 15 and 20 (inclusive). 
## dataset required

In [0]:
# Write a Python program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.
## dataset required

In [0]:
# Write a Python program to append a new row 'k' to Data Frame with given values for each column. Now delete the new row and return the original data frame.

In [0]:
# Write a Python program to sort the data frame first by 'name' in descending order, then by 'score' in ascending order. 
## dataset required

In [0]:
# Write a Python program to insert a new column in existing Data Frame.

In [0]:
# Write a Python program to change the name 'James' to 'Suresh' in name column of the data frame. 
## dataset required